Revit 2026 API

# SchedulableField(Guid) Constructor

---

Creates a new SchedulableField.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SchedulableField(
	Guid customFieldId
)
```
```vb
Public Sub New (
	customFieldId As Guid
)
```
```cpp
public:
SchedulableField(
	Guid customFieldId
)
```
```fsharp
new :
        customFieldId : Guid -> SchedulableField
```

#### Parameters

customFieldId Guid
     The Guid that identifies the custom field.

| Exception | Condition |
| --- | --- |
| ArgumentException | The provided guid doens't represent a valid custom field. |

#### Reference

SchedulableField Class

SchedulableField Overload

Autodesk.Revit.DB Namespace